app/controllers/articulos_controller.rb

  def index
    @articulos = Articulo.all
---
SELECT "articulos".* FROM "articulos" WHERE (titulo LIKE '%ss%') ORDER BY articulos.created_at DESC

  def show
    @articulo = Articulo.find(params[:id])
---
SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? ORDER BY articulos.created_at DESC LIMIT 1  [["id", "1"]]

  def create
    @articulo = Articulo.new(params[:articulo])

    respond_to do |format|
      if @articulo.save
---
INSERT INTO "articulos" ("created_at", "cuerpo", "titulo", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 29 Mar 2014 02:13:34 UTC +00:00], ["cuerpo", "Denos su opinion!"], ["titulo", "ss-logistics y su nueva etapa"], ["updated_at", Sat, 29 Mar 2014 02:13:34 UTC +00:00]]

  def destroy
    @articulo = Articulo.find(params[:id])
    @articulo.destroy
---
SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? ORDER BY articulos.created_at DESC LIMIT 1  [["id", "1"]]
DELETE FROM "articulos" WHERE "articulos"."id" = ?  [["id", 1]]