app/controllers/comentarios_controller.rb

  def index

    @articulo = Articulo.find(params[:articulo_id])
    #@comentarios = Comentario.all
    @comentarios = @articulo.comentarios#.order("created_at ASC")
---
SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? ORDER BY articulos.created_at DESC LIMIT 1  [["id", "1"]]
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."articulo_id" = 1 ORDER BY created_at DESC

  def show
    @comentario = Comentario.find(params[:id])

    @articulo = Articulo.find(params[:articulo_id])
---
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "1"]]
SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? ORDER BY articulos.created_at DESC LIMIT 1  [["id", "1"]]

  def new
    @comentario = Comentario.new

    @articulo = Articulo.find(params[:articulo_id])
---
SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? ORDER BY articulos.created_at DESC LIMIT 1  [["id", "1"]]

  def create
    @comentario = Comentario.new(params[:comentario])

    @articulo = Articulo.find(params[:articulo_id])
    @comentario.articulo_id = @articulo.id

    respond_to do |format|
      if @comentario.save
---
SELECT "articulos".* FROM "articulos" WHERE "articulos"."id" = ? ORDER BY articulos.created_at DESC LIMIT 1  [["id", "1"]]
INSERT INTO "comentarios" ("articulo_id", "contenido", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["articulo_id", 1], ["contenido", "Me parece excelente!"], ["created_at", Sat, 29 Mar 2014 02:13:48 UTC +00:00], ["updated_at", Sat, 29 Mar 2014 02:13:48 UTC +00:00]]