app/controllers/sessions_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."apodo" = 'vic' LIMIT 1
---
def create

	usuario = Usuario.find_by_apodo(params[:apodo])