app/controllers/usuarios_controller.rb

INSERT INTO "usuarios" ("apodo", "created_at", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
    def create

    @usuario = Usuario.new(params[:usuario])

	    if @usuario.save