app/views/articulos/index.html.erb

SELECT COUNT(*) FROM "comentarios" WHERE "comentarios"."articulo_id" = 1
---
    <td><%= articulo.cuerpo %></td>
    <td><%= articulo.comentarios.size %></td>