app/views/articulos/show.html.erb

SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."articulo_id" = 1 ORDER BY created_at DESC
---

<% @articulo.comentarios.each do |comentario| %>